export const kanaDictionary = {
	'hiragana': {
		'h_group1': { characters: { 'あ': ['a'], 'い': ['i'], 'う': ['u'], 'え': ['e'], 'お': ['å'] } },

		'h_group2': { characters: { 'か': ['ka'], 'き': ['ki'], 'く': ['ku'], 'け': ['ke'], 'こ': ['kå'] } },
		'h_group3': { characters: { 'さ': ['sa'], 'し': ['sji','ʃi','si'], 'す': ['su'], 'せ': ['se'], 'そ': ['så'] } },
		'h_group4': { characters: { 'た': ['ta'], 'ち': ['tsji','chi','ci','tʃi','ti'], 'つ': ['tsu','tu'], 'て': ['te'], 'と': ['tå'] } },
		'h_group5': { characters: { 'な': ['na'], 'に': ['ni'], 'ぬ': ['nu'], 'ね': ['ne'], 'の': ['nå'] } },
		'h_group6': { characters: { 'は': ['ha'], 'ひ': ['hi'], 'ふ': ['fu','hu','ɸu'], 'へ': ['he'], 'ほ': ['hå'] } },
		'h_group7': { characters: { 'ま': ['ma'], 'み': ['mi'], 'む': ['mu'], 'め': ['me'], 'も': ['må'] } },
		'h_group8': { characters: { 'や': ['ja'], '𛀆': ['ji'], 'ゆ': ['ju'], '𛀁': ['je'], 'よ': ['jå'] } },
		'h_group9': { characters: { 'ら': ['ra','la'], 'り': ['ri','li'], 'る': ['ru','lu'], 'れ': ['re','le'], 'ろ': ['rå','lå'] } },
		'h_group10': { characters: { 'わ': ['wa'], 'ゐ': ['wi'], '𛄟': ['wu'], 'ゑ': ['we'], 'を': ['wå'] } },
		'h_group11': { characters: { 'ん': ['n'] } },

		'h_group12_d': { characters: { 'が': ['ga'], 'ぎ': ['gi'], 'ぐ': ['gu'], 'げ': ['ge'], 'ご': ['gå'] } },
		'h_group13_d': { characters: { 'ざ': ['za'], 'じ': ['dji','dʒi', 'zi'], 'ず': ['zu','du'], 'ぜ': ['ze'], 'ぞ': ['zå'] } },
		'h_group14_d': { characters: { 'だ': ['da'], 'ぢ': ['dji','di','dzi'], 'づ': ['zu','dzu'], 'で': ['de'], 'ど': ['då'] } },
		'h_group15_d': { characters: { 'ば': ['ba'], 'び': ['bi'], 'ぶ': ['bu'], 'べ': ['be'], 'ぼ': ['bå'] } },
		'h_group16_d': { characters: { 'ら゙': ['ra'], 'り゙': ['ri'], 'る゙': ['ru'], 'れ゙': ['re'], 'ろ゙': ['rå'] } },
		'h_group17_d': { characters: { 'わ゙': ['va'], 'ゐ゙': ['vi'], '𛄟゙': ['vu'], 'ゑ゙': ['ve'], 'を゙': ['vå'] } },

		'h_group18_h': { characters: { 'か゚': ['ŋa','nga'], 'き゚': ['ŋi','ngi'], 'く゚': ['ŋu','ngu'], 'け゚': ['ŋe','nge'], 'こ゚': ['ŋå','ngå'] } },
		'h_group19_d': { characters: { 'ざ': ['þa','tha'], 'じ': ['þi','thi'], 'ず': ['þu','thu'], 'ぜ': ['þe','the'], 'ぞ': ['þå','thå'] } },
		'h_group19_h': { characters: { 'ぱ': ['pa'], 'ぴ': ['pi'], 'ぷ': ['pu'], 'ぺ': ['pe'], 'ぽ': ['på'] } },
		'h_group20_h': { characters: { 'ら゚': ['la'], 'り゚': ['li'], 'る゚': ['lu'], 'れ゚': ['le'], 'ろ゚': ['lå'] } },
		'h_group21_h': { characters: { 'わ゚': ['fa'], 'ゐ゚': ['fi'], '𛄟゚': ['fu'], 'ゑ゚': ['fe'], 'を゚': ['få'] } },

		'h_group31_b': { characters: { 'ざ゚': ['ða','dha'], 'じ゚': ['ði','dhi'], 'ず゚': ['ðu','dhu'], 'ぜ゚': ['ðe','dhe'], 'ぞ゚': ['ðå','dhå'] } },









		'h_group31_a': { characters: { 'きゃ': ['kja'], 'きゅ': ['kju'], 'きょ': ['kjå'] } },
		'h_group32_a': { characters: { 'しゃ': ['sja','ʃa'], 'しゅ': ['sju','ʃu'], 'しょ': ['sjå','ʃå'] } },
		'h_group33_a': { characters: { 'ちゃ': ['tsja','tʃa'], 'ちゅ': ['tsju','tʃu'], 'ちょ': ['tsjå','tʃå'] } },
		'h_group34_a': { characters: { 'にゃ': ['nja'], 'にゅ': ['nju'], 'にょ': ['njå'] } },
		'h_group35_a': { characters: { 'ひゃ': ['hja'], 'ひゅ': ['hju'], 'ひょ': ['hjå'] } },
		'h_group37_a': { characters: { 'みゃ': ['mja'], 'みゅ': ['mju'], 'みょ': ['mjå'] } },
		'h_group38_a': { characters: { 'りゃ': ['rja'], 'りゅ': ['rju'], 'りょ': ['rjå'] } },

		'h_group41_a': { characters: { 'ぎゃ': ['gja'], 'ぎゅ': ['gju'], 'ぎょ': ['gjå'] } },
		'h_group42_a': { characters: { 'じゃ': ['dja'], 'じゅ': ['dju'], 'じょ': ['djå'] } },
		'h_group43_a': { characters: { 'ぢゃ': ['dja'], 'ぢゅ': ['dju'], 'ぢょ': ['djå'] } },
		'h_group45_a': { characters: { 'びゃ': ['bja'], 'びゅ': ['bju'], 'びょ': ['bjå'] } },
		'h_group48_a': { characters: { 'り゙ゃ': ['rja'], 'り゙ゅ': ['rju'], 'り゙ょ': ['rjå'], } },
		'h_group48_a': { characters: { 'ゐ゙ゃ': ['vja'], 'ゐ゙ゅ': ['vju'], 'ゐ゙ょ': ['vjå'], } },

		'h_group51_a': { characters: { 'ぴゃ': ['pja'], 'ぴゅ': ['pju'], 'ぴょ': ['pjå'] } },
		'h_group52_a': { characters: { 'り゚ゃ': ['lja'], 'り゚ゅ': ['lju'], 'り゚ょ': ['ljå'] } }

	},
	'katakana': {
		'k_group1': { characters: { 'ア': ['a'], 'イ': ['i'], 'ウ': ['u'], 'エ': ['e'], 'オ': ['å'] } },

		'k_group2': { characters: { 'カ': ['ka'], 'キ': ['ki'], 'ク': ['ku'], 'ケ': ['ke'], 'コ': ['kå'] } },
		'k_group3': { characters: { 'サ': ['sa'], 'シ': ['sji','ʃi','si'], 'ス': ['su'], 'セ': ['se'], 'ソ': ['så'] } },
		'k_group4': { characters: { 'タ': ['ta'], 'チ': ['tsji','chi','ci','tʃi','ti'], 'ツ': ['tsu','tu'], 'テ': ['te'], 'ト': ['tå'] } },
		'k_group5': { characters: { 'ナ': ['na'], 'ニ': ['ni'], 'ヌ': ['nu'], 'ネ': ['ne'], 'ノ': ['nå'] } },
		'k_group6': { characters: { 'ハ': ['ha'], 'ヒ': ['hi'], 'フ': ['fu','hu'], 'ヘ': ['he'], 'ホ': ['hå'] } },
		'k_group7': { characters: { 'マ': ['ma'], 'ミ': ['mi'], 'ム': ['mu'], 'メ': ['me'], 'モ': ['må'] } },
		'k_group8': { characters: { 'ヤ': ['ja'], '𛄠': ['ji'],'ユ': ['ju'],'𛄡': ['je'], 'ヨ': ['jå'] } },
		'k_group9': { characters: { 'ラ': ['ra','la'], 'リ': ['ri','li'], 'ル': ['ru','lu'], 'レ': ['re','le'], 'ロ': ['rå','lå'] } },
		'k_group10': { characters: { 'ワ': ['wa'], 'ヰ': ['wi'], '𛄢': ['wu'], 'ヱ': ['we'], 'ヲ': ['wå'] } },
		'k_group11': { characters: { 'ン': ['n'] } },

		'k_group11_d': { characters: { 'ガ': ['ga'], 'ギ': ['gi'], 'グ': ['gu'], 'ゲ': ['ge'], 'ゴ': ['gå'] } },
		'k_group12_d': { characters: { 'ザ': ['za'], 'ジ': ['ji','zi'], 'ズ': ['zu','du'], 'ゼ': ['ze'], 'ゾ': ['zå'] } },
		'k_group13_d': { characters: { 'ダ': ['da'], 'ヂ': ['dji','di','dzi'], 'ヅ': ['zu','dzu'], 'デ': ['de'], 'ド': ['då'] } },
		'k_group14_d': { characters: { 'バ': ['ba'], 'ビ': ['bi'], 'ブ': ['bu'], 'ベ': ['be'], 'ボ': ['bå'] } },
		'k_group16_d': { characters: { 'ラ゙': ['ra'], 'リ゙': ['ri'], 'ル゙': ['ru'], 'レ゙': ['re'], 'ロ゙': ['rå'] } },
		'k_group17_d': { characters: { 'ヷ': ['va'], 'ヸ': ['vi'], 'ヴ': ['vu'], 'ヹ': ['ve'], 'ヺ': ['vå'] } },

		'k_group18_h': { characters: { 'カ゚': ['ŋa','nga'], 'キ゚': ['ŋi','ngi'], 'ク゚': ['ŋu','ngu'], 'ケ゚': ['ŋe','nge'], 'コ゚': ['ŋå','ngå'] } },
		'k_group21_h': { characters: { 'パ': ['pa'], 'ピ': ['pi'], 'プ': ['pu'], 'ペ': ['pe'], 'ポ': ['på'] } },
		'k_group22_h': { characters: { 'ラ゚': ['la'], 'リ゚': ['li'], 'ル゚': ['lu'], 'レ゚': ['le'], 'ロ゚': ['lå'] } },

		'k_group24_a': { characters: { 'キャ': ['kja'], 'キュ': ['kju'], 'キョ': ['kjå'] } },
		'k_group25_a': { characters: { 'シャ': ['sja','ʃa'], 'シュ': ['sju','ʃu'], 'ショ': ['sjå','ʃå'] } },
		'k_group26_a': { characters: { 'チャ': ['tsja'], 'チュ': ['tsju'], 'チョ': ['tsjå'] } },
		'k_group27_a': { characters: { 'ニャ': ['nja'], 'ニュ': ['nju'], 'ニョ': ['njå'] } },
		'k_group28_a': { characters: { 'ヒャ': ['hja'], 'ヒュ': ['hju'], 'ヒョ': ['hjå'] } },
		'k_group29_a': { characters: { 'ミャ': ['mja'], 'ミュ': ['mju'], 'ミョ': ['mjå'] } },
		'k_group30_a': { characters: { 'リャ': ['rja'], 'リュ': ['rju'], 'リョ': ['rjå'] } },

		'k_group31_a': { characters: { 'ギャ': ['gja'], 'ギュ': ['gju'], 'ギョ': ['gjå'] } },
		'k_group32_a': { characters: { 'ジャ': ['dja'], 'ジュ': ['dju'], 'ジョ': ['djå'] } },
		'k_group33_a': { characters: { 'ヂャ': ['dja'], 'ヂュ': ['dju'], 'ヂョ': ['djå'] } },
		'k_group34_a': { characters: { 'ビャ': ['bja'], 'ビュ': ['bju'], 'ビョ': ['bjå'] } },

		'k_group38_a': { characters: { 'ピャ': ['pja'], 'ピュ': ['pju'], 'ピョ': ['pjå'] } },
		'k_group40_a': { characters: { 'リ゚ャ': ['lja'], 'リ゚ュ': ['lju'], 'リ゚ョ': ['ljå'] } },





		'k_group41_s': { characters: { 'シ': ['sji','si'], 'ツ': ['tsu','tu'], 'ソ': ['så'], 'ン': ['n'], 'ノ': ['nå'] } },
		'k_group42_s': { characters: { 'ウ': ['u'], 'フ': ['fu','hu'], 'ワ': ['wa'], 'ラ': ['ra'], 'ス': ['su'], 'ヌ': ['nu'], 'ヲ': ['wå'] } },

		'k_group43_e': { characters: { 'ファ': ['fa'], 'フィ': ['fi'], 'フェ': ['fe'], 'フォ': ['få'], 'フュ': ['fju'] } },
		'k_group44_e': { characters: { 'ウィ': ['wi'], 'ウェ': ['we'], 'ウォ': ['wå'] } },
		'k_group45_e': { characters: { 'ヴァ': ['va'], 'ヴィ': ['vi'], 'ヴェ': ['ve'], 'ヴォ': ['vå'] } },
		'k_group46_e': { characters: { 'ツァ': ['tsa'], 'ツィ': ['tsi'], 'ツェ': ['tse'], 'ツォ': ['tså'] } },
		'k_group47_e': { characters: { 'チェ': ['tsje'], 'シェ': ['sje'], 'ジェ': ['je'] } },
		'k_group48_e': { characters: { 'ティ': ['ti'], 'ディ': ['di'], 'デュ': ['du'], 'トゥ': ['tu'] } }
	}
};
























