

		//'h_group11_d': { characters: { 'あ゙': ['?a'], 'い゙': ['?i'], 'ゔ': ['?u'], 'え゙': ['?e'], 'お゙': ['?å'] } },
		//'h_group15_d': { characters: { 'な゙': ['?a'], 'に゙': ['?i'], 'ぬ゙': ['?u'], 'ね゙': ['?e'], 'の゙': ['?å'] } },
		//'h_group17_d': { characters: { 'ま゙': ['?a'], 'み゙': ['?i'], 'む゙': ['?u'], 'め゙': ['?e'], 'も゙': ['?å'] } },
		//'h_group18_d': { characters: { 'や゙': ['?a'], '𛀆゙': ['?i'], 'ゆ゙': ['?u'], '𛀁゙': ['?e'], 'よ゙': ['?å'] } },
		//'h_group21_d': { characters: { 'あ゚': ['?a'], 'い゚': ['?i'], 'う゚': ['?u'], 'え゚': ['?e'], 'お゚': ['?å'] } },
		//'h_group23_h': { characters: { 'さ゚': ['tsa'], 'し゚': ['tsi'], 'す゚': ['tsu'], 'せ゚': ['tse'], 'そ゚': ['tså'] } },
		//'h_group24_h': { characters: { 'た゚': ['tsja','tʃa'], 'ち゚': ['tsji','tʃi'], 'つ゚': ['tsju','tʃu'], 'て゚': ['tsje','tʃe'], 'と゚': ['tsjå','tʃå'] } },
		//'h_group25_d': { characters: { 'な゚': ['?a'], 'に゚': ['?i'], 'ぬ゚': ['?u'], 'ね゚': ['?e'], 'の゚': ['?å'] } },
		//'h_group27_d': { characters: { 'ま゚': ['?a'], 'み゚': ['?i'], 'む゚': ['?u'], 'め゚': ['?e'], 'も゚': ['?å'] } },
		//'h_group28_d': { characters: { 'や゚': ['?a'], '𛀆゚': ['?i'], 'ゆ゚': ['?u'], '𛀁゚': ['?e'], 'よ゚': ['?å'] } },
		//'h_group56_a': { characters: { '𛀆ゃ': ['jja'], '𛀆ゅ': ['jju'], '𛀆ょ': ['jjå'] } },
		//'h_group64_a': { characters: { 'に゙ゃ': ['?ja'], 'に゙ゅ': ['?ju'], 'に゙ょ': ['?jå'] } },
		//'h_group66_a': { characters: { '𛀆゙ゃ': ['jja'], '𛀆゙ゅ': ['jju'], '𛀆゙ょ': ['jjå'] } },
		//'h_group67_a': { characters: { 'み゙ゃ': ['fja'], 'み゙ゅ': ['fju'], 'み゙ょ': ['fjå'], } },
		//'h_group17_d': { characters: { 'ゔ': ['vu'], 'セ゚': ['tse', 'ce'],'つ゚': ['tu'],'と゚': ['tu'],'ゟ': ['jåri'] } },


		'h_group59_a': { characters: { 'ゐゃ': ['wja'], 'ゐゅ': ['wju'], 'ゐょ': ['wjå'] } },
		'h_group69_a': { characters: { 'ゐ゙ゃ': ['vja'], 'ゐ゙ゅ': ['vju'], 'ゐ゙ょ': ['vjå'], } },
		'h_group71_a': { characters: { 'き゚ゃ': ['ŋja','ngja'], 'き゚ゅ': ['ŋju','ngju'], 'き゚ょ': ['ŋjå','ngjå'] } },



---


		'h_group9': { characters: { 'ら': ['a'], 'り': ['i'], 'る': ['u'], 'れ': ['e'], 'ろ': ['å'] } },







			'k_group15_d': { characters: { 'マ゙': ['fa'], 'ミ゙': ['fi'], 'ム゙': ['fu'], 'メ゙': ['fe'], 'モ゙': ['få'] } },

			'k_group19_h': { characters: { 'サ゚': ['tsa'], 'シ゚': ['tsi'], 'ス゚': ['tsu'], 'セ゚': ['tse'], 'ソ゚': ['tså'] } },

			'k_group20_h': { characters: { 'タ゚': ['tʃa','tsja'], 'チ゚': ['tʃi','tsji'], 'ツ゚': ['tʃu','tsju'], 'テ゚': ['tʃe','tsje'], 'ト゚': ['tʃå','tsjå'] } },

			'k_group23_dh': { characters: { 'ザ゚': ['ða','þa','θa','tha'], 'ジ゚': ['ði','þi','θi','thi'], 'ズ゚': ['ðu','þu','θu','thu'], 'ゼ゚': ['ðe','þe','θe','the'], 'ゾ゚': ['ðå','þå','θå','thå'] } },

			'k_group35_a': { characters: { 'ミ゙ャ': ['fja'], 'ミ゙ュ': ['fju'], 'ミ゙ョ': ['fjå'], } },

			'k_group36_a': { characters: { 'リ゙ャ': ['rja'], 'リ゙ュ': ['rju'], 'リ゙ョ': ['rjå'], } },

			'k_group37_a': { characters: { 'ヸャ': ['vja'], 'ヸュ': ['vju'], 'ヸョ': ['vjå'], } },



















